//** @file
//   Strings for POST Message Config utility DXE
//
//;******************************************************************************
//;* Copyright (c) 2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                                   #language en-US " "
                                                                           #language fr-FR " "
                                                                           #language zh-TW " "
                                                                           #language ja-JP " "
                                                                           #language it-IT " "
                                                                           #language es-ES " "
                                                                           #language de-DE " "
                                                                           #language pt-PT " "	
#string STR_DISABLED_TEXT                                                  #language en-US "Disabled"
                                                                           #language fr-FR "Désactiver"
                                                                           #language zh-TW "\wide停用\narrow"
                                                                           #language ja-JP "\wide使用しない\narrow"
                                                                           #language it-IT "Disabilitato"
                                                                           #language es-ES "inhabilitado"
                                                                           #language de-DE "Sperren"
                                                                           #language pt-PT "Proibir"
#string STR_ENABLED_TEXT                                                   #language en-US "Enabled"
                                                                           #language fr-FR "Activer"
                                                                           #language zh-TW "\wide啟用\narrow"
                                                                           #language ja-JP "\wide使用する\narrow"
                                                                           #language it-IT "abilitato"
                                                                           #language es-ES "permitido"
                                                                           #language de-DE "Aktivieren"
                                                                           #language pt-PT "Permitir"
													 
#string STR_NAME_VALUE_VAR_NAME0                                           #language en-US "MyNameValue0"

//
// Formset H2O_POST_MESSAGE_CONFIG_UTIL_CONFIG_PAGE_FORMSET_GUID 
//
#string STR_POST_MESSAGE_CONFIG_PAGE_FORMSET                               #language en-US "POST Message Configuration"
#string STR_POST_MESSAGE_CONFIG_PAGE_FORMSET_HELP                          #language en-US "Show POST Message Configuration"
//
// VFR_FORMID_POST_MESSAGE_CONFIG_PAGE
//
#string STR_POST_MESSAGE_CONFIG_PAGE                                       #language en-US "POST Message Configuration"
#string STR_POST_MESSAGE_CONFIG_PAGE_HELP                                  #language en-US "Show POST Message Configuration"

#string STR_POST_MESSAGE_CONFIG_STRING                                     #language en-US "POST Message Configuration"
#string STR_POST_MESSAGE_CONFIG_HELP                                       #language en-US "Enable / Disable the POST message settings."

#string STR_PROGRESS_CODE_MESSAGE_STRING                                   #language en-US " Progress Code"
#string STR_PROGRESS_CODE_MESSAGE_HELP                                     #language en-US "Progress Code Messages are Enabled/Disabled in the BIOS."

#string STR_ERROR_CODE_MESSAGE_STRING                                      #language en-US " Error Code"
#string STR_ERROR_CODE_MESSAGE_HELP                                        #language en-US "Error Code Messages are Enabled/Disabled in the BIOS."

#string STR_DEBUG_CODE_MESSAGE_STRING                                      #language en-US " Debug Code"
#string STR_DEBUG_CODE_MESSAGE_HELP                                        #language en-US "Debug Code Messages are Enabled/Disabled in the BIOS."

#string STR_LOG_POST_MESSAGE_STRING                                        #language en-US " Log POST Message"
#string STR_LOG_POST_MESSAGE_HELP                                          #language en-US "Enabled - POST Message will be logged to BIOS GPNV, BMC SEL or others event storage. Disabled- Don't log any POST Message"
#string STR_SHOW_POST_MESSAGE_STRING                                       #language en-US " Show POST Message"
#string STR_SHOW_POST_MESSAGE_HELP                                         #language en-US "Enabled - POST Message will show on screen after VGA is active. Disabled- Don't show any POST Message"

//
// End of file
//